apx = chr(8776) # Approximation Symbol ≈

Runge = {
    'A': {
        'Source': ['Условия', 'x₀', 'y₀', 'h', 'n'],
        'Result': ['Задание А', 'ᵢ', 'x', f'y {apx}', 'yₐₙ =', 'yₚᵣ = ']
    },
    'B': {
        'Source': ['Условия', 'x₀', 'y₀', "y'₀", 'a', 'b', 'h', 'n'],
        'Result': ['Задание B', 'i', 'x', 'y {apx}', "y' {apx}", "y'' {apx}", "y'' - ay' - by", 'погрешность']
    }
}

Tangent = {
    'Result': ['Результаты вычислений представлены в следующей таблице:',
        'ᵢ', 'x', 'F(xᵢ)', "F'(xᵢ)", '|F(xᵢ)| / m']
}

Simpson = {
    'Result': ['Результаты', 'ᵢ', 'xᵢ', 'i = 0, n', 'xᵢ четное', 'xᵢ нечетное']
}

Division = {
    'Source': ['Интервалы с корнями', 'i', 'Диапазон'],
    'Result': ['Найденные корни', 'i', 'Диапазон', 'Корень']
}
