Descriptions = {
    'Division': 'Формула F(x) = x⁴ - x - 1',
    'Tangent': {
        'A': '''
            Формула A

            F(x) = x³ + 0.2x² + 0.5x - 2

            F'(x) = 3x² + 0.4x + 0.5

            F''(x) = 6x + 4
        ''',
        'B': '''
            Формула B

            F(x) = tg(0.5x + 0.1) - x²

                            1 
            F'(x) = ━━━━━━━━━━━━━━━━ - 2x
                    cos²(0.5x + 0.1)

            F''(x) = 2·sin(0.5x + 0.1)·cos(0.5x + 0.1)
        '''
    },
    'Simpson': {
        'A': (
            '1) eᵃˣ  ·  sin(bx)',
            '''
                Производная 4-го порядка:

                (a⁴·sin(bx) + 4·a³·b·cos(bx) - 6·a²·b³·sin(bx) + b⁴·sin(bx))·eᵃˣ
            '''
        ),
        'B': (
            '''
                       1
                2) ━━━━━━━━━
                   √(x + a²)

            ''',
            '''
                Производная 4-го порядка:
                                  
                  105·x⁴     90·x²
                ━━━━━━━━━ - ━━━━━━ + 9
                (a + x²)²   a + x²
                ━━━━━━━━━━━━━━━━━━━━━━
                       (a + x²)²
            '''
        )
    },
    'Runge': {
        'A': (
            "y' = (1 + x²) · (1 + y)",
            '''  x + (x³ / 3)
            y = e            - 1
            '''
        ),
        'B': (
            """
                1) y'' - ay' - by = sin(x)

                2) y'' - ay' - by = e⁻ˣ
        
                3) y'' - ay' - by = cos(x)
            """,
            """
            y' = u
            y'' = u' = au + by + f(x)
            """
        )
    }
}
